do

function run(msg, matches)
return [[

🦁 الُـبّوَتْ يَْعمٌـلُ ْْعلُى الُمٌجْمٌوَْعاتْ الُتْيَ تْصّلُ الُى 5k🌐

    🦁 تْـمٌ تْطِوَيَرَ الُسِوَرَسِـ مٌنَ قًبّـلُ الُمٌطِوَرَيَنَ 
           🐯بّـكِوَرَيَ 
           🐯 صّادِقً
                      
مٌْعرَفَاتْ الُمٌطِوَرَيَنَ 
🦁 @ll_B5

🦁 @sadikal_knani10                       
            🐯 تْابّْع كِلُ مٌايٌَخصّ الُتْطِوَيَرَ ْعبّرَ قًنَاتْا الُوَحُيَدُِه 🐯
✈️ CH1:- @illOlli

🐯وَاذَا كِنَتْ تْرَيَدِ سِمٌاْع اجْمٌلُ الُاشِْعارَ تْابّْع قًنَاتْا الُوَحُيَدُِه 🐯

👁‍🗨 @KINGTELE1
                      
                 

]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
