do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م1' then 
    local ghost = [[ 
    👁‍🗨اوَامٌرَ الُاوَلُيَُه فَيَ الُمٌجْمٌوَْعُه👁‍🗨
✈️➖➖➖➖➖➖➖✈️
🦁-معلوماتي↜↯
((لُْعرَضُ مٌْعلُوَمٌاتْ الُْعضُوَ))      

🦁معلومات المجموعة↜↯
((لُْعرَضُ مٌْعلُوَمٌاتْ الُمٌجْمٌوَْعُه ))

🦁-الاعدادات↜↯ 
((لُْعرَضُ الُاْعدِادِتْ فَيَ الُمٌجْمٌوَْعُه))

🦁-موقعي↜↯
((لُْعرَضُ رَتْبّتْكِ فَيَ الُمٌجْمٌوَْعُه))   

🦁-الاعضاء↜↯
((لُْعرَضُ الُاْعضُاء فَيَ الُمٌجْمٌوَْعُه))     
  
🦁-رفع ادمن↜↯
((لُرَفَْع ادِمٌنَ فَيَ الُمٌجْمٌوَْعُه  )) 

 🦁-تنزيل ادمن↜↯
((لُتْنَزُيَلُ ادِمٌنَ فَيَ الُمٌجْمٌوَْعُه)) 

 🦁-الادمنيه↜↯
((لُْعرَضُ الُادِمٌنَيَُه فَيَ الُمٌجْمٌوَْعُه )) 
✈️➖➖➖➖➖➖➖✈️
🔭DE1:- @ll_B5 
🔭DE2:- @Sadikal_knani10 
🔭CH1 : @illOlli 
  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "لُاتْشِتْغًلُ بّكِيَفَكِ ُهايَ بّسِ لُلُادِمٌنَ 🐯🦁!" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م1)$", 
}, 
run = run 
} 
end
