do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م1' then 
    local ghost = [[ 
    🌸اوامر ادارة المجموعات 🌸 
🎗ـــــــــــــــــــــــــــــــــــــــ🎗
    🍁 معلوماتي ↜ معلومات العضو |🔱 
🍁معلومات المجموعة↜معلومات الكروب 
 🍁 الاعدادات ↜ الاعدادات في المجموعه |🔱
 🍁 موقعي ↜ موقعك في المجموعة |🔱
 🍁 الاعضاء ↜ قائمة الاعضاء |🔱
  🎗ـــــــــــــــــــــــــــــــــــــــ🎗
🍁 رفع ادمن ↜ رفع ادمن |🔱 
 🍁 تنزيل ادمن ↜ تنزيل ادمن |🔱 
🍁 الادمنيه ↜ قائمة الادمنية |🔱 
🎗ـــــــــــــــــــــــــــــــــــــــــ🎗
🍁 الرابط ↜ رابط الكروب |🔱 
🍁 وضع رابط ↜ وضع رابط |🔱 
 🍁 رابط جديد ↜ رابط جديد |🔱 
🎗ـــــــــــــــــــــــــــــــــــــــــ🎗
🍁 ضع قوانين  ↜ لوضع القوانين |🔱 
🍁 القوانين ↜ رؤية القوانين |🔱 
🍁 ضع وصف ↜ لوضع الوصف |🔱 
🍁 ضع اسم ↜ لوضع اسم |🔱 
🍁 ضع صورة ↜ وضع صوره |🔱
🎗ــــــــــــــــــــــــــــــــــــــ🎗
⛔️حذف  ↴ حذف ⛔️ 
🍁 الادمنية ↜ الادمنية |🔱 
🍁 الوصف ↜ الوصف |🔱 
🍁 المكتومين ↜ المكتومين |🔱 
🍁 القوانين ↜  القوانين |🔱 
🎗ـــــــــــــــــــــــــــــــــــــ🎗 
🍃DEV 1:- @illOlli 🙂🍷
🍃DEV 2:- @Sadikal_knani10 
🍃channel : @KINGTELE1 🙂🍷 
  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م1)$", 
}, 
run = run 
} 
end
