do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م2' then 
    local ghost = [[ 
   🚁 اوَامٌـرَالثُانَوَيَُه فَيَ الُمٌجْمٌوَْعُه🚁
✈️➖➖➖➖➖➖➖✈️ 
👁‍🗨-الرابط ↜ ↯
((لُْعرَضُ الُرَابّطِ فَيَ الُمٌجْمٌوَْعُه )) 

 👁‍🗨-وضع رابط ↜↯
(( وَضُْع رَابّطِ فَيَ الُمٌجْمٌوَْعُه ))

 👁‍🗨-رابط جديد ↜ ↯
((لُْعرَضُ رَابّطِ الُجْدِيَدِ فَيَ الُمٌجْمٌوَْعُه))

 👁‍🗨-ضع قوانين ↜↯
(( لُوَضُْع قًوَانَيَينََ لُلُمٌجْمٌوَْعُه ))

 👁‍🗨-القوانين ↜↯
(( لُرَؤيَُه الُقًوَانَيَنَ فَيَ الُمٌجْمٌوَْعُه ))   

 👁‍🗨-ضع وصف ↜ ↯
((لوَضُْع وَصّفَ فَيَ الُمٌجْمٌوَْعُه  ))

 👁‍🗨-ضع اسم ↜↯ 
((لُوَضُْع اسِمٌ لُلُمٌجْمٌوَْعُه  )) 

 👁‍🗨-ضع صورة ↜ ↯
((لُوَضُْع صّوَرَُه فَيَ الُمٌجْمٌوَْعُه ))

⛔️حذف  ↴ حذف ⛔️ 
 👁‍🗨-الادمنية ↜↯ 
((الحُذَفَ الُادِمٌنَيَُه فَيَ الُمٌجْمٌوَْعُه   )) 

 👁‍🗨-الوصف ↜↯
(( لُحُذَفَ الُوَصّفَ فَيَ الُمٌجْمٌوَْعُه   ))

 👁‍🗨-المكتومين ↜↯
(( الحُذَفَ الُمٌكِتْوَمٌيَنَ فَيَ الُمٌجْمٌوَْعةِ ))

 👁‍🗨-القوانين ↜↯
  ((لُحُذَفَ الُقًوَانَيَنَ فَيَ الُمٌجْمٌوَْعُه ))

✈️➖➖➖➖➖➖➖✈️
🔭DE1: @ll_B5 
🔭DE2: @Sadikal_knani10 
🔭CH : @illOlli 
  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م2)$", 
}, 
run = run 
} 
end
