do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م2' then 
    local ghost = [[ 
    🌿 أوامر الحماية داخل المجموعة 🌿 
🎗ــــــــــــــــــــــــــ🎗
 🍁 طرد <معرف-رد> ↜ لطرد |🔱 
🍁 كتم <معرف-رد> ↜ كتم |🔱 
🍁 حظر <معرف-رد> ↜لحظر |🔱 
🍁الغاء الحظر <معرف-رد↜الغاء الحظر |🔱
🍁 قائمة الحظر ↜ المحظورين |🔱 
🍁 ايدي ↜ ايدي |🔱 
🍁 مغادرة ↜ مغادرة |🔱
🎗ــــــــــــــــــــــــــــــ🎗 
🌸اوامر الفتح والقفل في المجموعة🌸️ 
       🎖ـــــــــــــــــــــــ🎖   
🍁 قفل الصوت ↜ لمنع الصوتيات |🔱 
🍁 قفل الصور المتحركة↜لمنع المتحركة |🔱
🍁 قفل الصور ↜ لمنع الصور |🔱 
 🍁 قفل الفيديو ↜ لمنع الفديوات |🔱 
🍁 قفل اعاده التوجية ↜ لمنع التوجيه |🔱 
🍁 قفل التكرار ↜ لمنع التكرار |🔱 
🍁 قفل البوتات ↜ لمنع البوتات |🔱
🍁 قفل الروابط ↜ لمنع الروابط |🔱 
🍁 قفل الاضافة ↜ لمنع الاضافة |🔱 
🍁قفل الاضافة الجماعية↜لمنع الجماعية |🔱 
🍁 قفل اشعارات↜ اشعارات الدخول |🔱 
🍁قفل جهات اتصال↜ جهات الاتصال |🔱 
🍁 قفل الكلايش ↜ لمنع الكلايش  |🔱 
🍁 قفل الدردشه ↜ لمنع المحادثة |🔱 
🍁 قفل العربيه ↜ اللغة العربية |🔱
🎗ــــــــــــــــــــــــــــ 🎗
🌸طريقة استخدام الاوامر🌸 
🍁 قفل + الامر ⇐ للقفل ⇑ 
🍁  فتح + الامر ⇐ للفتح ⇑ 
🎗ــــــــــــــــــــــــــــ🎗
🎖 DEV 1 :- @illOlli 🙂🍷 
 🎖DEV2: @Sadikal_knani10
🏅channel : @KINGTELE1 🙂🍷 
    ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م2)$", 
}, 
run = run 
} 
end
