do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م3' then 
    local ghost = [[ 
    🚁 أوامر الحماية داخل المجموعة 🚁 
✈️➖➖➖➖➖➖➖✈️
 👁‍🗨 طرد <معرف-رد> ↜
(( لطرد لعضو من المجموعه))

👁‍🗨كتم <معرف-رد>↜↯
    ((كتم العضو في المجموعه ))

👁‍🗨 حظر <معرف-رد> ↜↯
        ((لحظر العضو في المجموعه ))

👁‍🗨الغاء الحظر <معرف-رد↜↯
             ((الغاء الحظر في المجموعه))

👁‍🗨 قائمة الحظر ↜↯
((لعرض  المحظورين في المجموعه))

🌸اوامر الفتح والقفل في المجموعة🌸️ 
       🎖ـــــــــــــــــــــــ🎖   
👁‍🗨قفل الصوت ↜↯
         (( لمنع الصوتيات )) 

👁‍🗨 قفل الصور المتحركة↜↯
                  ((لمنع المتحركة ))

👁‍🗨 قفل الصور ↜↯
             (( لمنع الصور ))

👁‍🗨 قفل الفيديو ↜ ↯
           ((لمنع الفديوات ))

👁‍🗨 قفل اعاده توجية ↜↯
                ((لمنع التوجيه  ))

👁‍🗨 قفل التكرار ↜ ↯
              ((لمنع التكرار ))

👁‍🗨 قفل البوتات ↜ ↯
               ((لمنع البوتات ))

👁‍🗨 قفل الروابط ↜ 
       ((لمنع الروابط  ))

👁‍🗨 قفل الاضافة ↜↯
            (( لمنع الاضافة ))

👁‍🗨قفل الاضافة الجماعية↜↯
                    ((لمنع الجماعية ))  

👁‍🗨قفل اشعارات↜↯
               (( اشعارات الدخول))  

👁‍🗨قفل جهات اتصال↜↯ 
               ((جهات الاتصال  ))

👁‍🗨 قفل الكلايش ↜↯ 
              ((لمنع الكلايش))  
 
👁‍🗨 قفل الدردشه ↜ ↯
               ((لمنع المحادثة  ))

👁‍🗨 قفل العربيه ↜ ↯
               ((اللغة العربية ))
✈️➖➖➖➖➖➖➖✈️
🌸طريقة استخدام الاوامر🌸 
👁‍🗨 قفل + الامر ⇐ للقفل ⇑ 
👁‍🗨  فتح + الامر ⇐ للفتح ⇑ 
✈️➖➖➖➖➖➖➖✈️
🔭 DE1 @illOlli  
 🔭DE2 @Sadikal_knani10
🔬CH1 @KINGTELE1 
    ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م3)$", 
}, 
run = run 
} 
end