--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY @sadikal_knani10                 ▀▄ ▄▀ 
▀▄ ▄▀   BY @illOlli   (@kingtele1)     ▀▄ ▄▀    
▀▄ ▄  JUST WRITED BY sadik        ▀▄ ▄▀ 
▀▄ ▄▀            مساعدة 1                  ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]] 
do

function run(msg, matches)
local reply_id = msg['id']
local S = [[ 
♻️ اوامر الميديا ♻️

🌐 يستعمل مع الاوامر كلمت 👈 (فتح او قفل )❗️

✴️ الفيديو: 👈 (التحكم بالفيديو داخل المجموعه)
✴️ الصوت: 👈 (التحكم بالصوت داخل المجموعه)
✴️ الصور: 👈 (التحكم بالصور داخل المجموعه)
✴️ الملصقات: 👈 (التحكم بالصوت داخل المجموعه)
✴️ الجماعيه: 👈 (التحكم بالجماعيه داخل المجموعه)
✴️ الصور المتحركه: 👈 (التحكم بالصور المتحركه داخل المجموعه)

〰️〰️〰️〰️〰️〰️〰️〰️〰️
-🔧 DEV 1 : @sadikal_knani10
-🔧 DEV 2 : @illOlli
-🔧 DEV CH👹: @KINGTELE1 
 ]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م4)$",
},
run = run 
}
end
