do

local function run(msg, matches)
local reply_id = msg['id']
if is_sudo(msg) and matches[1]== "م المطور" then
local S = [[  👇 اوامر المطور 👇

✈️➖➖➖➖➖➖➖➖✈️
🦁 تفعيل ↜↯
 ((لُتْفَْعيَلُ الُبّوَتْ فَيَ الُمٌجْمٌوَْعُه ))

🦁 تعطيل ↜ ↯
((لُتْْعطِيَلُ الُبّوَتْ فَيَ الُمٌجْمٌوَْعُه)) 

 🦁اذاعه ↜↯
 ((لُْعمٌلُ اذَاْعُه فَيَ الُمٌجْمٌوَْعاتْ))

🦁 تشغيل البوت ↜↯
 ((لُتْشِغًيَلُ الُبّوَتْ فَيَ مٌجْمٌوَْعُه مٌْعيَنَُه))

🦁 نظف ↜↯
((لُتْنَظٌيَفَ الُمٌجْمٌوَْعُه بّلُ ْعدِدِ))

 🦁طرد البوت ↜↯
(( لُطِرَدِ الُبّوَتْ فَيَ الُمٌجْمٌوَْعُه ))

🦁لاضافه رد ↜↯
((رد اضف +اسم الرد + الرد التريده))

 🦁رد حذف +اسم ↜↯
              (( لُحُدِفَــــ الُرَدِ ))

 🦁الردود ↜ ↯
((لْعرَضُ الُرَدِوَدِ الُتْيَ تْمٌ اضُافَتُْهنَ)) 

 🦁الملفات ↜ ↯
((لْعرَضُ مٌلُفَاتْ الُبّوَتْ)) 

 🦁تفعيل الملف ↜↯
 ((لتْفَْعيَلُ الُمٌلُفَ مٌنَ دِاٌخلُ الُمٌجْمٌوَْعُه ))

 🦁تعطيل الملف ↜ ↯
((لتْْعطِيَلُ الُمٌلُفَ مٌنَ دِاٌخلُ الُمٌجْمٌوَْعُه ))

 🦁جلب الملف ↜↯
(( لجْلُبّ مٌلُفَاتْ الُبّوَتْ ))

 🦁صنع مجموعه ↜ ↯
((لصنع مجموعه من البوت))
✈️➖➖➖➖➖➖➖✈️
        🌿اوامر السيرفر🌿
              
🦁 run↝↯
(( لتْنَشِيَطِ الُسِيَرَفَرَ دِاٌخلُ الُمٌجْمٌوَْعُه))
🦁 update ↝↯
 ((لتْحُدِيثُ الُسِيَرَفَرَ  دِاٌخلُ الُمٌجْمٌوَْعُه))
🦁 redis ↝↯
((لتْصّحُيَحُ الُبّوَتْ دِاٌخلُ الُمٌجْمٌوَْعُه))
              
✈️➖➖➖➖➖➖➖✈️
 👁‍🗨DE 1 : @ll_B5
 👁‍🗨DE 2 : @Sadikal_knani10 
 👁‍🗨CH1 : @illOlli 
]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_sudo(msg) then
local S = "ليش تبحبش😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م المطور)$",
},
run = run 
}
end
