do

local function run(msg, matches)
local reply_id = msg['id']
if is_sudo(msg) and matches[1]== "م المطور" then
local S = [[  👇 اوامر المطور 👇

🎗ـــــــــــــــــــــــــــــــ🎗
🍁 تفعيل ↜ لتفعيل البو في المجموعه |🔱
🍁 تعطيل ↜ لتعطيل البوت بل مجموعه |🔱
🍁 اذاعه ↜ لعمل اذاعه في المجموعه |🔱
🍁 تشغيل البوت ↜ تشغيل في مجموعه معينه
🍁 طرد البوت ↜ لطرده من المجموعه |🔱
 🍁 رد اضف +اسم الرد + الرد التريده ↜لضافه رد
🍁 رد حذف +اسم ↜ لحذف الرد |🔱
🍁 الردود ↜ لعرض ردود ملف الربلي |🔱
🍁 الملفات ↜ لعرض ملفات البوت |🔱
🍁 تفعيل الملف ↜ لتفعيل ملف المعطل 
🍁 تعطيل الملف ↜ لتعطل ملف المفعل 
🍁 جلب الملف ↜ لجلب ملفات البوت |🔱
🍁 صنع مجموعه ↜ لصنع مجموعه من البوت
🎗ــــــــــــــــــــــــــــــــ🎗
        🌿اوامر السيرفر🌿
           🎖ـــــــــ🎖   
🍁 run↝ لتنشيط سيرفر البوت 
🍁 update ↝ لتحديث سيرفر البوت 
🍁 redis ↝ لتصحيح الاخطا البوت
                🎗ـــــــــــــــــــــــــــ🎗
🏅 DEV 1 : @illOlli
🏅 DEV 2 : @Sadikal_knani10 
🏅channel : @KINGTELE1 
]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_sudo(msg) then
local S = "ليش تبحبش😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م المطور)$",
},
run = run 
}
end
